# Contents
Import libraries and customers dataset, orders_products_agg.pkl

Wrangle customer data

Merge data 

Export to cust_orders_products_all.pkl

# Import Libraries

In [53]:
#install analysis libraries

import pandas as pd
import numpy as np
import os

In [54]:
path = r'C:\Users\Samantha Ramos\Desktop\Instacart Basket Analysis 12-16-2023'

In [55]:
#install customers dataset
cust = pd.read_csv(os.path.join(path, '02 Data','Original Data', 'customers.csv'))

In [56]:
ords_prods_merge = pd.read_pickle(os.path.join(path, '02 Data','Prepared Data', 'orders_products_agg.pkl'))

# Wrangle Customers Data

In [57]:
#check first 5 rows
cust.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

# Check for Data Type Inconsistencies

In [58]:
#check data types
cust.dtypes

user_id          int64
First Name      object
Surnam          object
Gender          object
STATE           object
Age              int64
date_joined     object
n_dependants     int64
fam_status      object
income           int64
dtype: object

In [59]:
#change data type of user_id column to string(object in pandas)
cust['user_id'] = cust['user_id'].astype('str')

In [60]:
cust['user_id'].dtype

dtype('O')

In [61]:
#check for mixed types
for col in cust.columns.tolist():
  weird = (cust[[col]].map(type) != cust[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (cust[weird]) > 0:
    print (col)

First Name

In [62]:
#change data type of First Name
cust['First Name'] = cust['First Name'].astype('str')

First Name column had mixed data type so I changed all data to string, or object.

# Rename Columns

In [63]:
#change name of 'Surnam' column
cust.rename(columns = {'Surnam' : 'Surname'}, inplace = True)

In [64]:
#clarify meaning of 'fam_status' column
cust.rename(columns = {'fam_status' : 'marital_status'}, inplace = True)

In [65]:
#change name of 'STATE' column
cust.rename(columns = {'STATE' : 'State'}, inplace = True)

# Find Missing Values

In [66]:
#find missing values
cust.isnull().sum()

user_id           0
First Name        0
Surname           0
Gender            0
State             0
Age               0
date_joined       0
n_dependants      0
marital_status    0
income            0
dtype: int64

In [67]:
#find the rows with missing values
cust_nan = cust[cust['First Name'].isnull()==True]

In [68]:
cust_nan.head()

Empty DataFrame
Columns: [user_id, First Name, Surname, Gender, State, Age, date_joined, n_dependants, marital_status, income]
Index: []

In [69]:
cust.shape

(206209, 10)

In [70]:
#dataset without Nan values
cust_clean = cust[cust['First Name'].isnull() == False]

In [71]:
cust_clean.shape

(206209, 10)

In [72]:
#to find duplicate values
cust_dups = cust_clean[cust_clean.duplicated()]

In [73]:
cust_dups

Empty DataFrame
Columns: [user_id, First Name, Surname, Gender, State, Age, date_joined, n_dependants, marital_status, income]
Index: []

There are no duplicate values in the custmer dataframe

cust.describe()

# Drop Unnecessary Columns

In [74]:
#dropping first name and last name columns
cust_clean.drop(columns = ['First Name', 'Surname'])

,user_id,Gender,State,Age,date_joined,n_dependants,marital_status,income
0,26711,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Female,Maryland,26,1/1/2017,1,married,40374
...,...,...,...,...,...,...,...,...
206204,168073,Female,North Carolina,44,4/1/2020,1,married,148828
206205,49635,Male,Hawaii,62,4/1/2020,3,married,168639
206206,135902,Female,Missouri,66,4/1/2020,2,married,53374
206207,81095,Female,California,27,4/1/2020,1,married,99799
206208,80148,Female,New York,55,4/1/2020,1,married,57095

In [75]:
ords_prods_merge.head()

,product_id,product_name,aisle_id,department_id,prices,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,...,_merge,price_range_loc,busiest_day,busiest_days,max_order,loyalty_flag,user_avg_price,spending_flag,med_order_freq,order_freq_flag
0,1,Chocolate Sandwich Cookies,61,19,5.8,3139998,138,28,6,11,...,both,Mid-range product,Regularly busy,Regularly busy,32,Regular customer,6.935811,Low spender,8.0,Frequent customer
1,1,Chocolate Sandwich Cookies,61,19,5.8,1977647,138,30,6,17,...,both,Mid-range product,Regularly busy,Regularly busy,32,Regular customer,6.935811,Low spender,8.0,Frequent customer
2,1,Chocolate Sandwich Cookies,61,19,5.8,389851,709,2,0,21,...,both,Mid-range product,Busiest day,Busiest day,5,New customer,7.930208,Low spender,8.0,Frequent customer
3,1,Chocolate Sandwich Cookies,61,19,5.8,652770,764,1,3,13,...,both,Mid-range product,Regularly busy,Least busy,3,New customer,4.972414,Low spender,9.0,Frequent customer
4,1,Chocolate Sandwich Cookies,61,19,5.8,1813452,764,3,4,17,...,both,Mid-range product,Least busy,Least busy,3,New customer,4.972414,Low spender,9.0,Frequent customer

In [76]:
#check data type of user_id column
ords_prods_merge['user_id'].dtype

dtype('int64')

# Merge Customers Data with Combined Data

In [77]:
#change data type of user_id column to string(object in pandas) to match customer dataframe
ords_prods_merge['user_id'] = ords_prods_merge['user_id'].astype('str')

In [78]:
#Merge customer and order data
df_cust_ords_prods = cust.merge(ords_prods_merge, on = 'user_id')

In [79]:
# Export data to pkl

df_cust_ords_prods.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'cust_orders_products_all.pkl'))